[
  {
    "archivo": "AccionDePersonal.pdf",
    "contenido": "Acción de Personal en Contra de Juanito Montero  \nFecha:  7 de abril de 2025  \nEmpleado:  Juanito Montero  \nDepartamento:  Monitoreo de Servicios Web  \nPuesto:  Encargado de Monitoreo de Servicios Web  \nFecha del Incidente:  6 de abril de 2025  \n \nMotivo de la Acción de Personal:  \nEl día 6 de abril de 2025, el empleado Juanito Montero  incurrió en una serie de fallos en sus \nresponsabilidades relacionadas con el monitoreo de los servicios web de la empresa Patito EC . \nEl incidente fue resultad...",
    "extraccion": "**Empresa:** Patito EC\n**Perjuicio:** Pérdida estimada de $100,000 debido a la caída del servicio web VentadePatos.com.\n**Tipo de problema:** Falta de supervisión y cumplimiento de protocolos en monitoreo de servicios web.\n**Causa:** Juanito Montero incurrió en una serie de fallos en sus responsabilidades relacionadas con el monitoreo de los servicios web, lo que provocó la caída del servicio web VentadePatos.com.\n**Involucrados:** Juanito Montero, empleado de Monitoreo de Servicios Web, y Patito EC.\n**Reporta:** La acción de personal fue reportada por los recursos humanos de la empresa.\n**Sanciones:**\n\n1. Advertencia escrita formal\n2. Suspensión temporal sin goce de sueldo (2 días)\n3. Capacitación obligatoria en protocolos de emergencia y monitoreo\n4. Revisión de desempeño con evaluación más estricta en los próximos 3 meses."
  },
  {
    "archivo": "DiarioDeGerente.pdf",
    "contenido": "Diario de Gerente – Reflexión Post -Incidente  \nFecha:  7 de abril de 2025  \nHoy ha sido un día complicado. Recibí el informe completo sobre el incidente ocurrido con la \ncaída del sitio web VentadePatos.com  y, sinceramente, me dejó con una mezcla de frustración y \npreocupación. El daño ya está hecho, pero me detuve a reflexionar sobre cómo llegamos a este \npunto.  \nEl hecho de que Juanito Montero , el encargado del monitoreo, haya estado tan desatento y haya \ndejado que el sistema cayera de es...",
    "extraccion": "**Empresa:** VentadePatos.com (caída del sitio web)\n\n**Perjuicio:** Pérdida económica de 100K, afectados 120 usuarios\n\n**Tipo de problema:** Negligencia humana y falta de protocolo de respaldo efectivo en el monitoreo del sistema.\n\n**Causa:** Desatento monitoreo por parte de Juanito Montero, encargado del monitoreo.\n\n**Involucrados:** Juanito Montero (encargado del monitoreo), Carlos Gómez (autor de la acción de personal).\n\n**Reporta:** Sebastián Rivera (gerente) a través de su diario post-incidente.\n\n**Sanciones:** No se mencionan sanciones específicas, pero se sugiere una revisión más estricta del enfoque de la acción de personal y una mayor disciplina interna."
  },
  {
    "archivo": "EmailPersonal.pdf",
    "contenido": "Asunto:  Bro... lo de anoche fue una novela  \nDe: juanito.montero@patitoec.com  \nPara:  carlos.gomez@patitoec.com  \n \n¡Ey bro!  \nTe juro que esto que te voy a contar no es broma (aunque parece sacado de una comedia trágica \n      ). \nAyer en la noche me fui a la fiesta de cumpleaños del primo de Esteban (sí, ese que siempre hace \nel asado más seco del mundo). No me iba a quedar mucho rato… pero apareció Valentina  (sí, \nla Valentina      ). No la veía hace semanas, y bro... ya tú sabes. Terminam...",
    "extraccion": "¡Claro! Aquí te dejo la información extraída del texto:\n\nEmpresa: No encontrado\nPerjuicio: Pérdida de 100K de dinero debido a un fallo en el servidor de base de datos.\nTipo de problema: Fallo en el servidor de base de datos, específicamente una alarma que no se activó correctamente.\nCausa: Se cree que la alarma se configuró con \"repetir mañana\" en lugar de \"una vez\", lo que llevó a un fallo en los servicios del sitio web.\nInvolucrados: No se menciona explícitamente, pero se puede inferir que involucra a Juanito (el remitente) y la empresa VentadePatos.com.\nReporta: El remitente, Juanito, informa al destinatario, Carlos Gomez, sobre el problema que enfrentó con el servidor de base de datos.\nSanciones: No se menciona ninguna sanción específica, pero se menciona que el remitente está \"castigándose\" autoimpuesto comiendo solo hoy."
  },
  {
    "archivo": "ReporteIncidentes.pdf",
    "contenido": "Reporte de Incidente – Servidor de Base de Datos  \nEmpresa:  Patito EC  \nFecha del incidente:  6 de abril de 2025  \nDuración total:  4 horas  \nServicio afectado:  Página web principal – VentadePatos.com  \n \nResumen Ejecutivo  \nEl día 6 de abril de 2025, la empresa Patito EC experimentó un incidente crítico en su servidor \nde base de datos que provocó la caída total del sitio web VentadePatos.com durante varias horas. \nEl problema se originó por un consumo inusualmente alto de memo ria RAM, regis...",
    "extraccion": "**Empresa:** Patito EC\n\n**Perjuicio:** La empresa Patito EC sufrió una pérdida estimada de $100,000 debido al incidente crítico en su servidor de base de datos.\n\n**Tipo de problema:** El incidente fue causado por un consumo inusualmente alto de memoria RAM, lo que generó indisponibilidad del servicio y afectó directamente la operatividad de la empresa.\n\n**Causa:** La causa humana fue el encargado de monitoreo se quedó dormido y no activó su alarma, lo que permitió que el incidente fuera más grave.\n\n**Involucrados:** El encargado de monitoreo y los 120 usuarios internos que quedaron sin acceso a servicios durante el incidente.\n\n**Reporta:** La empresa Patito EC reportó el incidente el día 6 de abril de 2025, con una duración total de 4 horas y una indemnización estimada de $100,000.\n\n**Sanciones:** No se mencionan sanciones específicas en el texto, pero se sugiere que la empresa debe implementar medidas para prevenir futuros incidentes, como la creación de una nueva web de respaldo y el mejoramiento del monitoreo proactivo."
  }
]